## 1. Loading libraries

In [44]:
# Load libraries

import pandas as pd
import numpy as np  

# Ignore warnings

import warnings
warnings.filterwarnings('ignore')

## 2. Import of data

In [75]:
# Import the adress, main, paid_record csv files.

address = pd.read_csv('data/raw/address.csv')
main = pd.read_csv('data/raw/main.csv')
paid_record = pd.read_csv('data/raw/paid_record.csv')

### 2.1 Analysis of duplicates and nulls

#### 2.1.1 Address

In [46]:
# Check address duplicates

address[address.duplicated()]

# Check address null values

address.isnull().sum()

New_ID     0
ADDRESS    0
dtype: int64

In [47]:
# Check unique values of address

address.nunique()

New_ID     438652
ADDRESS      6440
dtype: int64

In [48]:
# Check duplicates of address

address[address.duplicated()]

         New_ID                                  ADDRESS
438657  6477848  6702 Johnny Mercer Boulevard, 31410, GA
438658  6779547             06040, CT, 739 Center Street
438659  6691705            68 Hampstead Place, 01331, MA
438660  6747064             9 Brooklyn Street, 05488, VT
438661  5559115          713 East 32nd Street, 31401, GA
...         ...                                      ...
438752  5680433           37080, TN, 7730 Wilkinson Road
438753  5353755      2815 Saint Edwards Drive, 37211, TN
438754  5689895           85306, AZ, 5434 West Beck Lane
438755  5833391                05641, VT, 21 Hill Street
438756  6395895   73120, OK, 2316 Northwest 113th Street

[100 rows x 2 columns]

Remove duplicate values

In [49]:
# Check duplicates of address

address[address.duplicated()]

# Show the duplicates in New_id sorted by New_id

address[address.New_ID.duplicated()].sort_values(by=['New_ID'])

# Drop the duplicates in New_id

address.drop_duplicates(subset=['New_ID'], inplace=True)

# Head of address

address.head()

     New_ID                               ADDRESS
0  5008804L           06042, CT, 31 Mitchell Road
1  5008805G  72703, AR, 1189 Northwest End Avenue
2  5008806D          72701, AR, 218 Shipley Alley
3  5008808I    3138 P Street Northwest, 20007, DC
4  5008809Z          2405 230th Street, 21122, MD

Since we only want the identifier without the initial letter, we proceed to remove it.

In [50]:
# If there is a letter in New_ID, delete it

address['New_ID'] = address['New_ID'].str.replace('[a-zA-Z]', '')

# Head of address

address.head()

    New_ID                               ADDRESS
0  5008804           06042, CT, 31 Mitchell Road
1  5008805  72703, AR, 1189 Northwest End Avenue
2  5008806          72701, AR, 218 Shipley Alley
3  5008808    3138 P Street Northwest, 20007, DC
4  5008809          2405 230th Street, 21122, MD

In [51]:
# Shape of address.

print('The dataset of address has {} rows and {} columns'.format(address.shape[0], address.shape[1]))

The dataset of address has 438652 rows and 2 columns

We will call the variable related to the ID in all datasets `ID`.

In [52]:
# Rename New_ID to ID.

address.rename(columns={'New_ID': 'ID'}, inplace=True)

In [53]:
# Type of data in address.

address.dtypes

ID         object
ADDRESS    object
dtype: object

Since the IDs are in object format, we convert them to numeric format.

In [54]:
# Change ID to numeric.

address['ID'] = pd.to_numeric(address['ID'])

#### 2.1.2 Main

Delete duplicates of main

In [55]:
#Show the duplciates of main by Main_ID.

main[main.Main_ID.duplicated()].sort_values(by=['Main_ID'])

# Drop the duplicates of main by Main_ID.

main.drop_duplicates(subset=['Main_ID'], inplace=True)

# Shape of main.

print('The dataset of address has {} rows and {} columns'.format(main.shape[0], main.shape[1]))

The dataset of address has 438510 rows and 19 columns

Modify the title of the identifier variable to ID

In [56]:
# Change the variable Main_ID to ID.

main.rename(columns={'Main_ID': 'ID'}, inplace=True)

We unify the two tables analysed into one table.

In [57]:
# Merge address and main by ID.

df = pd.merge(address, main, on='ID', how='inner')

# Head of df.

df.head()

,ID,ADDRESS,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS,DAYS_BIRTH_CLEAN,Letter
0,5008804,"06042, CT, 31 Mitchell Road",M,Y,Y,0.0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-4542.0,1.0,1.0,0.0,0.0,NaN,2.0,09/04/1990,L
1,5008805,"72703, AR, 1189 Northwest End Avenue",M,Y,Y,0.0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-4542.0,1.0,1.0,0.0,0.0,NaN,2.0,09/04/1990,G
2,5008806,"72701, AR, 218 Shipley Alley",M,Y,Y,0.0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-1134.0,1.0,0.0,0.0,0.0,Security staff,2.0,06/05/1964,D
3,5008808,"3138 P Street Northwest, 20007, DC",F,N,Y,0.0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-3051.0,1.0,0.0,1.0,1.0,Sales staff,1.0,26/10/1970,I
4,5008809,"2405 230th Street, 21122, MD",F,NaN,Y,0.0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-3051.0,1.0,0.0,1.0,1.0,Sales staff,1.0,26/10/1970,Z

In [58]:
# Shape of df.

print('The dataset of address has {} rows and {} columns'.format(df.shape[0], df.shape[1]))

The dataset of address has 438652 rows and 20 columns

#### 2.1.3 Paid_record

In [59]:
# Head of paid_record.

paid_record.head()

        ID  MONTHS_BALANCE STATUS
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

From this dataset, we will obtain the target variable to work with. We will consider 0 (Good payer) for those who have paid their quota and 1 (Bad payer) for those who are late in their payments.

In [60]:
# Replace C and X for 0

paid_record['STATUS'] = paid_record['STATUS'].str.replace('C', '0')

paid_record['STATUS'] = paid_record['STATUS'].str.replace('X', '0')

# Head of paid_record

paid_record.head()

        ID  MONTHS_BALANCE STATUS
0  5001711               0      0
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      0

In [61]:
# Check type of data of test

paid_record.dtypes

ID                 int64
MONTHS_BALANCE     int64
STATUS            object
dtype: object

We transform the values of the variable `Status` into integers.

In [62]:
# Convert the 'STATUS' values to int

paid_record['STATUS'] = paid_record['STATUS'].astype(int)

In [63]:
# Check type of data of test

paid_record.dtypes

ID                int64
MONTHS_BALANCE    int64
STATUS            int32
dtype: object

In [65]:
# Pivot table of paid_record

paid_record = pd.pivot_table(paid_record, values='STATUS', index=['ID'], aggfunc=np.sum)

In [68]:
# Show the head of paid_record

paid_record.head()

         STATUS
ID
5001711       0
5001712       0
5001713       0
5001714       0
5001715       0

We transform to 1 those that are not equal to 0.

In [69]:
# If status isn't 0, change to 1

paid_record['STATUS'] = paid_record['STATUS'].apply(lambda x: 1 if x != 0 else 0)

We check the different values

In [70]:
# Distinct values of status

paid_record['STATUS'].value_counts()

0    40635
1     5350
Name: STATUS, dtype: int64

## 3. Unification of the final table

In [72]:
# Merge df and paid_record by ID

final_df = pd.merge(df, paid_record, on='ID', how='inner')

In [74]:
# Shape of final_df

print('The dataset of address has {} rows and {} columns'.format(final_df.shape[0], final_df.shape[1]))

# Head of final_df

final_df.head()

The dataset of address has 36462 rows and 21 columns

,ID,ADDRESS,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,...,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS,DAYS_BIRTH_CLEAN,Letter,STATUS
0,5008804,"06042, CT, 31 Mitchell Road",M,Y,Y,0.0,427500.0,Working,Higher education,Civil marriage,...,-4542.0,1.0,1.0,0.0,0.0,NaN,2.0,09/04/1990,L,1
1,5008805,"72703, AR, 1189 Northwest End Avenue",M,Y,Y,0.0,427500.0,Working,Higher education,Civil marriage,...,-4542.0,1.0,1.0,0.0,0.0,NaN,2.0,09/04/1990,G,1
2,5008806,"72701, AR, 218 Shipley Alley",M,Y,Y,0.0,112500.0,Working,Secondary / secondary special,Married,...,-1134.0,1.0,0.0,0.0,0.0,Security staff,2.0,06/05/1964,D,0
3,5008808,"3138 P Street Northwest, 20007, DC",F,N,Y,0.0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,...,-3051.0,1.0,0.0,1.0,1.0,Sales staff,1.0,26/10/1970,I,0
4,5008809,"2405 230th Street, 21122, MD",F,NaN,Y,0.0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,...,-3051.0,1.0,0.0,1.0,1.0,Sales staff,1.0,26/10/1970,Z,0

Proceed to export the Dataframe to CSV

In [176]:
# Export final_df to csv

final_df.to_csv('data/processed/final_df.csv', index=False)

## 4. (Extra) Multilabel Board

In [94]:
# Load paid_record

paid_record = pd.read_csv('data/raw/paid_record.csv')

In [95]:
paid_record.head()

        ID  MONTHS_BALANCE STATUS
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

In [96]:
# Replace C and X for 0

paid_record['STATUS'] = paid_record['STATUS'].str.replace('C', '0')

paid_record['STATUS'] = paid_record['STATUS'].str.replace('X', '0')

# Head of paid_record

paid_record.head()

        ID  MONTHS_BALANCE STATUS
0  5001711               0      0
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      0

In [97]:
# Convert the 'STATUS' values to int

paid_record['STATUS'] = paid_record['STATUS'].astype(int)

In [98]:
# SUM STATUS BY ID

paid_record = paid_record.groupby(['ID']).sum()

In [99]:
# Sum of STATUS

multilabel = paid_record.sort_values(by=['STATUS'], ascending=False)

In [100]:
# If STATUS  is higher between 1 and 60, change to 1. If it's between 61-120 then change to 2,   If it's between 121-180 then change to 3, If it's between 181-240 then change to 4.

multilabel['STATUS'] = multilabel['STATUS'].apply(lambda x: 1 if x >= 1 and x <= 60 else 2 if x >= 61 and x <= 120 else 3 if x >= 121 and x <= 180 else 4 if x >= 181 and x <= 240 else 0)

# Head of multilabel

multilabel.head()

         MONTHS_BALANCE  STATUS
ID
5142361           -1770       4
5142362           -1770       4
5085886           -1830       4
5117313           -1378       4
5116304           -1653       4

In [101]:
# Distinct values of STATUS

multilabel['STATUS'].value_counts()

0    40635
1     5295
2       38
4        9
3        8
Name: STATUS, dtype: int64

We join the final multilabel table with the rest of the variables by means of the ID.

In [102]:
# Merge df and paid_record by ID

final_df_multilabel = pd.merge(df, multilabel, on='ID', how='inner')

Export the dataframe in CSV

In [177]:
# Export final_df to csv

final_df_multilabel.to_csv('data/processed/final_df_multilabel.csv', index=False)